var React = require('react'); // достатньо тільки назви модуля, так як він встановлений чере npm?
var ReactDOM = require('react-dom');
var Greeter = require('./components/Greeter');
/* не вказуємо розширення, так як у конфігурації webpack вказали розширення,
 які ми підтримуємо */

var firstName = 'Vitaliy';

ReactDOM.render(
    <Greeter name={firstName} message="Message" />, // властивості можуть бути будь-якого типу, не лише рядок
    document.getElementById('app')
);

/*
  властивості задаються об'єктам при ініціалізації
  компонент не може змінювати власні властивості, але може 
  змінювати state

  Додаток:
   - підтимує state
   - показує інформацію користувачу
   - показує форму для отримання даних від користувача

  Компонент статичний - якщо він відображає незмінну інформацію

  Яка різниця між <GreeterMessage /> і <GreeterMessage></GreeterMessage>?

  Один компонент відповідає за одну річ. single responsibility principle

  Чи можна з іншого компонента дістатися до ref?
  Як стилізувати компонент?

  При розробці додатку нормально зробити спочатку статитчні компоненти, а потім 
  зробити їх динамічними.

  Коли у нас є батьківський компонент, що обробляє подію від дитини, ми зазвичай називаємо функцію 
  handleBlaBlaBla і викликаємо в дитині з назвою onBlaBlaBla
*/ 